if OS.mac?
    # taps
    tap "homebrew/cask"
    tap "homebrew/cask-fonts"

    brew "mas"
    brew "noti"
    brew "trash"

    # Applications
    cask "kitty"
    cask "imageoptim"
    cask "notion"
    cask "hazel"
    cask "anybar"
    cask "istat-menus"
    cask "textbar"
    cask "rocket"
    cask "cleanshot"
#    cask "vmware-fusion"
    cask "timing"
    cask "choosy"
    cask "soundsource"
    cask "farrago"
    cask "loopback"
    cask "audio-hijack"
    cask "paw"
    cask "postman"

    # Browsers
    cask "firefox"

    # Fonts
    cask "font-fira-code"
    cask "font-jetbrains-mono"
    cask "font-cascadia-mono"
    cask "font-3270-nerd-font"

elsif OS.linux?
    brew "xclip"
end

tap "homebrew/bundle"
tap "homebrew/core"
tap "schniz/tap"

# packages
brew "ack"
brew "bat"
brew "cloc"
brew "git-delta"
brew "entr"
brew "exa"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "gnupg"
brew "grep"
brew "highlight"
brew "htop"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "markdown"
brew "neofetch"
brew "neovim"
brew "python"
brew "ripgrep"
brew "schniz/tap/fnm"
brew "shellcheck"
brew "tmux"
brew "tree"
brew "vim"
brew "wdiff"
brew "wget"
brew "z"
brew "zsh"
brew "pyenv"
brew "pyenv-virtualenv"
brew "openssl"
brew "readline"
brew "sqlite3"
brew "xz"
brew "zlib"
